In [4]:
import pandas as pd
import pandera as pa

In [7]:
s1 : pd.Series = pd.Series([1,2,3,4,5,6])
s1

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [8]:
s1 : pd.Series = pd.Series((1,2,3,4,5,6))
s1

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [9]:
s1 : pd.Series = pd.Series({"a":1,
                            "b":2,
                            "C":3,
                            "d":4,
                            "e": 5,
                            "f": 6})
s1

a    1
b    2
C    3
d    4
e    5
f    6
dtype: int64

In [10]:
values : list[int] = [1,2,3,4,5]
index1 : list[str] = ["a","b","c","d","e"]

s1 : pd.Series = pd.Series(values, index=index1)
s1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [13]:
values : list[int] = [1,2,3,4,5]
index1 : list[list[str]] = [
                            ["a1","a1","a1","b1","b"],
                            ["a","b","c","d","e"]]

s1 : pd.Series = pd.Series(values, index=index1)
s1

a1  a    1
    b    2
    c    3
b1  d    4
b   e    5
dtype: int64

In [ ]:
values : list[int] = [1,2,3,4,5]
index1 : list[list[str]] = [
                            ["a1","a1","a1","b1","b"],
                            ["a","b","c","d","e"]]

s1 : pd.Series = pd.Series(values, index=index1,
                           name="student_name",
                           dtype:int32)
s1

In [41]:
from nptyping import DataFrame
s1 : pd.Series = pd.Series([1,2,3,4,5],name="student Id")
s2 : pd.Series = pd.Series([10,20,30,40,50], name= "Score")
s3 : pd.Series = pd.Series(["Amir","ALi","Hamza","Rashid","Aqib"],name = "Student name")

df1 : pd.DataFrame = pd.DataFrame({"student id":s1,"Score":s2 ,"Student name":s3})
df1

# df2 : pd.DataFrame = pd.concat([s1,s2,s3], axis=1)
# df2

   student id  Score Student name
0           1     10         Amir
1           2     20          ALi
2           3     30        Hamza
3           4     40       Rashid
4           5     50         Aqib

In [42]:
from nptyping import DataFrame
s1 : pd.Series = pd.Series([1,2,3,4,5])
s2 : pd.Series = pd.Series([10,20,30,40,50])
s3 : pd.Series = pd.Series(["Amir","ALi","Hamza","Rashid","Aqib"])

df1 : pd.DataFrame = pd.DataFrame({"student id":s1,"Score":s2 ,"Student name":s3})
df1

   student id  Score Student name
0           1     10         Amir
1           2     20          ALi
2           3     30        Hamza
3           4     40       Rashid
4           5     50         Aqib